Use mermaid instead of plantuml
