--- a/tunnel_server/README.md
+++ b/tunnel_server/README.md
@@ -2,94 +2,89 @@
 
 ## Connection
 
-```plantuml
+```mermaid
+sequenceDiagram
+
 title Serverless Tunnel Connection Sequence Diagram
 
-skinparam maxMessageSize 260
-skinparam ParticipantPadding 20
-skinparam BoxPadding 10
-
 box Local Network
-    participant "Local MoosicBox Server\n(moosicbox_server)" as MoosicBox
-end box
-
-box Cloud #ffd28f
-    box Lambda #ffd28f
-        participant "Tunnel WS\n(moosicbox_tunnel_server_ws)" as WS
-end box
-
-box PlanetScale #8fc3ff
-    database MySQL
-end box
-
-MoosicBox -> WS: Connect request
-WS -> MoosicBox: Connect success
-
-MoosicBox -> WS: [InitConnection]\n{clientId: "12345"}
-MoosicBox -> MySQL: Upsert client_id and tunnel_ws_id in `connections` table
-
-loop each 5 minutes (to keep lamda ws alive)
-    MoosicBox -> WS: [Ping]
-    WS -> MoosicBox: [Pong]
+    participant MoosicBox as Local MoosicBox Server<br>(moosicbox_server)
 end
+
+box rgb(255, 210, 143) Cloud
+    participant WS as Tunnel WS<br>(moosicbox_tunnel_server_ws)
+end
+
+box rgb(143, 195, 255) PlanetScale
+    participant MySQL
+end
+
+MoosicBox ->> WS: Connect request
+WS ->> MoosicBox: Connect success
+
+MoosicBox ->> WS: [InitConnection]<br>{clientId: "12345"}
+WS ->> MySQL: Upsert client_id and tunnel_ws_id in `connections` table
+
+loop every 5 minutes (to keep lambda ws alive)
+    MoosicBox ->> WS: [PING]
+    WS ->> MoosicBox: [PONG]
+end
+
 ```
 
 ## Data Stream Request
 
@@ -166,88 +158,81 @@ deactivate Client#gray
 
 ## Connection
 
-```plantuml
+```mermaid
+sequenceDiagram
+
 title Server Tunnel Connection Sequence Diagram
 
-skinparam maxMessageSize 260
-skinparam ParticipantPadding 20
-skinparam BoxPadding 10
-
 box Local Network
-    participant "Local MoosicBox Server\n(moosicbox_server)" as MoosicBox
-end box
+    participant MoosicBox as Local MoosicBox Server<br>(moosicbox_server)
+end
 
-box Cloud #ffd28f
-    box "Server\n(moosicbox_tunnel_server)"
-        participant "Tunnel WS\n(moosicbox_tunnel_server_ws)" as WS
-    end box
-end box
+box Server
+    participant WS as Tunnel WS<br>(moosicbox_tunnel_server)
+end
 
-box PlanetScale #8fc3ff
-    database MySQL
-end box
+box rgb(143, 195, 255) PlanetScale
+    participant MySQL
+end
 
-MoosicBox -> WS: Connect request
-WS -> MoosicBox: Connect success
+MoosicBox ->> WS: Connect request
+WS ->> MoosicBox: Connect success
 
-MoosicBox -> WS: [InitConnection]\n{clientId: "12345"}
-MoosicBox -> MySQL: Upsert client_id and tunnel_ws_id in `connections` table
+MoosicBox ->> WS: [InitConnection]<br>{clientId: "12345"}
+WS ->> MySQL: Upsert client_id and tunnel_ws_id in `connections` table
 
-loop each 5 minutes
-    MoosicBox -> WS: [Ping]
-    WS -> MoosicBox: [Pong]
+loop every 5 minutes
+    MoosicBox ->> WS: [PING]
+    WS ->> MoosicBox: [PONG]
 end
 ```
 
 ## Data Stream Request
 
